import { NextPage } from "next";
import Head from "next/head";

const About: NextPage = () => {
  return (
    <div>
      <Head>
        <title>About</title>
      </Head>
      <main className="max-w-[70ch] h-full m-auto font-serif text-base px-6 py-12 sm:text-lg first-letter:pl-6">
        Қазіргі уақытта қазақ лексикасында жаңа атаулар мен терминдердің
        қалыптану, нормалану үдерістері шапшаң жүріп жатыр. Сондықтан әрбір тың
        сөзге саналы көзқараспен қарап, оның қазақ тіліндегі объективті
        түсіндірмесінің болғаны жөн. «ІТ анықтамалық сөздігінің» басты мақсаты –
        ІТ саласы маманының қазақ тіліндегі кәсіби сауаттылығын қалыптастыру мен
        дамыту үшін пайдалы лексикографиялық анықтамалық ұсыну. Сөздікте ІТ
        саласында жиі кездесетін терминдер мен терминдік сипаттағы сөз
        тіркестерінің қазақ, орыс, ағылшын тілдеріндегі баламасы және қазақ
        тіліндегі анықтамасы берілген. ІТ саласындағы коммуникативтік актіде
        қолданылатын күрделі атаулар мен олардың қысқарған нұсқасы іріктелген.
        Авторлар сөздікті құрастыру кезінде ғылыми әдебиеттерде келтірілген
        анықтамаларды пайдаланған. Сонымен қатар кейбір терминдер мен олардың
        түсіндірмесі алғаш рет ұсынылып отыр. Электрондық сөздік практикалық
        қазақ тілін, ақпараттық технологияларды және осыған ұқсас курстарды оқып
        жатқан студенттер мен магистранттарға, докторанттарға арналған.
        Анықтамалық сөздікті құрастырғандар: педагогика ғылымдарының кандидаты,
        қауымдастырылған профессор Г.К.Камиева, филология ғылымдарының
        кандидаты, қауымдастырылған профессор Б.Б.Динаева және 2021-2022 оқу
        жылындағы 2-курс студенттері. Сөздікті компьютерде теру, сөздерді
        әліпбилік жүйеге келтіру, түзету сияқты техникалық жұмыстарды
        жүргізгендер: Д. Шевченко, А.Зұлпыхар, А. Уалиханова, Д. Хамза,
        А.Мусина.
      </main>
    </div>
  );
};

export default About;
